backend/app/controllers/api/v1/games_controller.rb

INSERT INTO "games" ("score", "end_timestamp", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["score", 10], ["end_timestamp", "2023-07-30 22:42:52.309000"], ["created_at", "2023-07-30 22:42:52.612539"], ["updated_at", "2023-07-30 22:42:52.612539"]]
INSERT INTO "game_settings" ("game_id", "addition_range_start", "addition_range_end", "multiplication_range_start", "multiplication_range_end", "duration", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"
INSERT INTO "questions" ("game_id", "num1", "num2", "op_type", "answer", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["game_id", 1], ["num1", 60], ["num2", 6], ["op_type", "/"], ["answer", 10], ["created_at", "2023-07-30 22:42:53.499115"], ["updated_at", "2023-07-30 22:42:53.499115"]]
---
      def create
        game = Game.create!(score: params[:score], end_timestamp: params[:endTimestamp])
        game.create_game_setting!(
          addition_range_start: params[:additionRange][:min],
          addition_range_end: params[:additionRange][:max],
          multiplication_range_start: params[:multiplicationRange][:min],
          multiplication_range_end: params[:multiplicationRange][:max],
          duration: params[:duration]
        )

        params[:answeredQuestions].each do |question|
          game.questions.create!(
            num1: question[:num1],
            num2: question[:num2],
            op_type: question[:opType],
            answer: question[:answer]
          )

SELECT "games".* FROM "games" ORDER BY "games"."end_timestamp" DESC
---
      def index
        games = Game.order(end_timestamp: :desc)

SELECT "games".* FROM "games" WHERE "games"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
      def show
        game = Game.find(params[:id])

SELECT "games".* FROM "games" WHERE "games"."id" = $1 LIMIT $2  [["id", 9], ["LIMIT", 1]]
DELETE FROM "games" WHERE "games"."id" = $1  [["id", 9]]
---
      def destroy
        game = Game.find(params[:id])
        game.destroy